In [21]:
import pandas as pd

## 예제 1-10 내부 원소 처리 기준

In [22]:
import numpy as np

In [23]:
# 1~10까지의 임의의 수를 3*3배열에 생성한다.

In [24]:
np.random.randint(1,10,(3,3))

array([[8, 3, 2],
       [3, 8, 5],
       [2, 6, 2]])

In [25]:
df_1 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns = list('ABC'))

In [26]:
df_1

   A  B  C
0  5  9  5
1  4  7  2
2  2  2  5

In [27]:
df_2 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns = list('CAB'))

In [28]:
df_2

   C  A  B
0  3  8  6
1  5  1  1
2  4  1  2

In [37]:
# 열을 맞추어 계산한다.
df_1 + df_2

    A   B  C
0  13  15  8
1   5   8  7
2   3   4  9

In [34]:
# 현재의 프레임은 유지되면서 각종 연산함수의 값이 각각의 원소에 업데이트 된다.

In [35]:
np.log(df_2)

          C         A         B
0  1.098612  2.079442  1.791759
1  1.609438  0.000000  0.000000
2  1.386294  0.000000  0.693147

In [30]:
df_2

   C  A  B
0  3  8  6
1  5  1  1
2  4  1  2

In [32]:
df_3 = pd.DataFrame(np.random.randint(1,10,(3,2)),columns = list('CB'))

In [33]:
df_3

   C  B
0  4  8
1  9  5
2  8  7

In [ ]:
#df_3은 A열이 없으므로 없는 값(nan)과의 연산으로 A열의 모든 값은 NaN이 된다.

In [38]:
df_1 + df_3

    A   B   C
0 NaN  17   9
1 NaN  12  11
2 NaN   9  13